Revit 2027 API
StairsType Properties
The StairsType type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
CanBeCopied |  Determine if this ElementType can create a copy
(Inherited from ElementType)
CanBeDeleted |  Determine if this ElementType can be deleted
(Inherited from ElementType)
CanBeRenamed |  Determine if this ElementType can be renamed
(Inherited from ElementType)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
ConstructionMethod |  The construction method of the stairs.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
EndConnectionType |  The join style between a run and landing.
FamilyName |  Gets the family name of this element type.
(Inherited from ElementType)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasMiddleSupports |  True if the stairs type has middle supports, False otherwise.
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LandingType |  The type for all landings in the stair element.
LeftLateralOffset |  The offset for the left support from the edge of the run in a horizontal direction.
LeftSideSupportType |  The type of left support used in the stair.
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
MaxRiserHeight |  The maximum height of each riser on the stair element.
MiddleSupportsNumber |  The number of middle supports used in the stair.
MiddleSupportType |  The type of middle supports used in the stair.
MinRunWidth |  The initial value for the width of a common run.
MinTreadDepth |  The minimum tread width along the center path for all common runs (winder, arc, and straight).
Name | Set the name for the ElementType.
(Inherited from ElementType)
NotchExtension |  The horizontal length of the notch profile.
NotchHorizontalGap |  The width of the horizontal gap in the stairs notch.
NotchThickness |  The vertical length of the notch profile from the top.
NotchVerticalGap |  The width of the vertical gap in the stairs notch.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
RightLateralOffset |  The offset for the right support from the edge of the run in a horizontal direction.
RightSideSupportType |  The type of right support used in the stair.
RunType |  The type for all runs in the stair element.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace